In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df1 = pd.read_csv(r'D:\CLOUDYML\internship\Dataset\domestic_visitor\domestic_visitors_2016.csv')

In [3]:
df1.head()

   district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016   792136
1  Adilabad  01-02-2016  February  2016   937820
2  Adilabad  01-03-2016     March  2016   582946
3  Adilabad  01-04-2016     April  2016   341948
4  Adilabad  01-05-2016       May  2016   252887

In [4]:
df2 = pd.read_csv(r'D:\CLOUDYML\internship\Dataset\domestic_visitor\domestic_visitors_2017.csv')

In [5]:
df3 = pd.read_csv(r'D:\CLOUDYML\internship\Dataset\domestic_visitor\domestic_visitors_2018.csv')

In [6]:
df4 = pd.read_csv(r'D:\CLOUDYML\internship\Dataset\domestic_visitor\domestic_visitors_2019.csv')

In [7]:
df = pd.concat([df1,df2,df3,df4], ignore_index = True)

In [8]:
df.head()

   district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016   792136
1  Adilabad  01-02-2016  February  2016   937820
2  Adilabad  01-03-2016     March  2016   582946
3  Adilabad  01-04-2016     April  2016   341948
4  Adilabad  01-05-2016       May  2016   252887

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1512 entries, 0 to 1511
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  1512 non-null   object
 1   date      1512 non-null   object
 2   month     1512 non-null   object
 3   year      1512 non-null   int64
 4   visitors  1482 non-null   object
dtypes: int64(1), object(4)
memory usage: 59.2+ KB

In [10]:
df.isnull().sum()

district     0
date         0
month        0
year         0
visitors    30
dtype: int64

In [11]:
df.fillna(0, inplace= True)

In [12]:
df.isnull().sum()

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [13]:
df5 = pd.read_csv(r'D:\CLOUDYML\internship\Dataset\Foreign_Visitor\foreign_visitors_2016.csv')

In [14]:
df6 = pd.read_csv(r'D:\CLOUDYML\internship\Dataset\Foreign_Visitor\foreign_visitors_2017.csv')

In [15]:
df7 = pd.read_csv(r'D:\CLOUDYML\internship\Dataset\Foreign_Visitor\foreign_visitors_2018.csv')

In [16]:
df8 = pd.read_csv(r'D:\CLOUDYML\internship\Dataset\Foreign_Visitor\foreign_visitors_2019.csv')

In [17]:
dff = pd.concat([df5,df6,df7,df8],ignore_index = False)

In [18]:
dff.head()

   district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016        2
1  Adilabad  01-02-2016  February  2016        0
2  Adilabad  01-03-2016     March  2016        2
3  Adilabad  01-04-2016     April  2016        0
4  Adilabad  01-05-2016       May  2016        0

In [19]:
dff['visitors'] = dff['visitors'].replace(np.nan,0)

In [20]:
dff.isnull().sum()

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [21]:
df.to_csv(r'D:\CLOUDYML\internship\Dataset\domestic_visitor.csv',index=False)

In [22]:
dff.to_csv(r'D:\CLOUDYML\internship\Dataset\foreign_visitor.csv',index=False)